In [1]:
#Eliminar duplicados en DataFrames

In [2]:
import pandas as pd

In [3]:
valores = [[1,2],[1,2],[5,6],[5,8]]

In [4]:
indices = list('mnop')

In [5]:
columnas = ['valor1','valor2']

In [6]:
dataframe = pd.DataFrame(valores,index=indices,columns=columnas)
dataframe

   valor1  valor2
m       1       2
n       1       2
o       5       6
p       5       8

In [7]:
#elimino duplicados

In [11]:
dataframe2 = dataframe.drop_duplicates()
dataframe2

   valor1  valor2
m       1       2
o       5       6
p       5       8

In [12]:
#Elimino duplicados de la columna valor1

In [13]:
dataframe2.drop_duplicates(['valor1'])

   valor1  valor2
m       1       2
o       5       6

In [14]:
#para quedarnos con el ultimo duplicado

In [15]:
dataframe2.drop_duplicates(['valor1'],keep='last')

   valor1  valor2
m       1       2
p       5       8